<h1><center>INDEX</center></h1><br>


1. [Pre requisites](#p1)<br>
1 1. [Important URL's for quick reference](#s1)<br>
1 2. [Installing alll required Packages ](#s2)<br>
3. [Playing with Plottly - Visualization](#s3) <br>
3 1. [Display data in the Tabler form](#s4) <br>
3 2. [Scatter plot](#s5)<br>
3 3. [Heat map](#s6)<br>
3 4. [Scatter Pairplot](#s7)<br>
4. [Loading Trainig Dataset and verifying](#s8)
5. [Loading Test Dataset and verifying](#s9)
6. [Working with different ML Algorithms](#s10)<br>
6 1. [Preparing Train Test](#s11)<br>
6 2. [Auto ML - TPOT](#s12)<br>
6 3. [Diff models : Logistic, RandomForest, SVC, Bagging, Voting](#s13)
7. [Conclusion](#s14)

1 Pre requsites <a name = p1></a>

# Important URL's for quick reference <a name = "s1"></a>

https://www.w3schools.com/python/python_mysql_select.asp <br>
https://www.datacamp.com/community/tutorials/mysql-python <br>
https://www.databasejournal.com/features/mysql/article.php/3904531/The-10-Most-Common-MySQL-Queries.htm <br>

## 1 1 Installing all required packages <a name = "s2"></a>
<br>1. mysql.connector
<br>2. sqlalchemy
<br>3. psycopg2-binary

In [0]:
!pip install mysql.connector
!pip install sqlalchemy
!pip install psycopg2-binary
!pip install pymysql

Collecting mysql.connector
  Downloading https://files.pythonhosted.org/packages/28/04/e40098f3730e75bbe36a338926f566ea803550a34fb50535499f4fc4787a/mysql-connector-2.2.9.tar.gz (11.9MB)
     |████████████████████████████████| 11.9MB 52kB/s
Building wheels for collected packages: mysql.connector
  Building wheel for mysql.connector (setup.py) ... done
  Created wheel for mysql.connector: filename=mysql_connector-2.2.9-cp36-cp36m-linux_x86_64.whl size=247949 sha256=63d4d2db79bf12115e8c5d97352d229fb1bbaaa0e57f15e22a1af5355a14e59c
  Stored in directory: /root/.cache/pip/wheels/8c/83/a1/f8b6d4bb1bd6208bbde1608bbfa7557504bed9eaf2ecf8c175
Successfully built mysql.connector
Installing collected packages: mysql.connector
Successfully installed mysql.connector
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.6/dist-packages (1.3.13)
Collecting psycopg2-binary
  Downloading https://files.pythonhosted.org/packages/1e/c0/16303cef8d54fdcfae7be7880cf471f21449225687f61cc3be2a7ef4e6e5/psycopg2_binary-2.8.4-cp36-cp36m-manylinux1_x86_64.whl (2.9MB)
     |████████████████████████████████| 2.9MB 2.8MB/s
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.8.4
Collecting pymysql
  Downloading https://files.pythonhosted.org/packages/ed/39/15045ae46f2a123019aa968dfcba0396c161c20f855f11dea6796bcaae95/PyMySQL-0.9.3-py2.py3-none-any.whl (47kB)
     |████████████████████████████████| 51kB 1.7MB/s
Installing collected packages: pymysql
Successfully installed pymysql-0.9.3

##1 2 Importing all required packages

In [0]:
# Importing mysql Packages

import mysql.connector as mysql
from sqlalchemy import create_engine

#Importing Pandas 

import pandas as pd

# To connect to Google Drive : 

from google.colab import drive
drive.mount('/content/drive')

print("Import completed")

ModuleNotFoundError: ignored

# Connecting the Database

In [0]:
db = mysql.connect(
    host = "cpanel.insaid.co",
    user = "student",
    passwd = "student",
    database = "Capstone1"
)
print("Details of the connected DB : ", db)

Details of the connected DB :  <mysql.connector.connection.MySQLConnection object at 0x7ff65bca69e8>

# Fetch details of Tables :

In [0]:
cursor = db.cursor()
## getting all the tables which are present in 'db' database
cursor.execute("SHOW TABLES")
tables = cursor.fetchall() ## it returns list of tables present in the database
## showing all the tables one by one
print("List of Tables under the database : student")
for table in tables:
    print(table)

List of Tables under the database : student
('events_data',)
('gender_age_train',)
('phone_brand_device_model',)

# Find the count of rows on each Table :

In [0]:
cursor = db.cursor()
cursor.execute("select count(*) from events_data")
tables = cursor.fetchall() ## it returns list of tables present in the database
## showing all the tables one by one
for table in tables:
    print("Table events_data has ", table, " rows")

cursor.execute("select count(*) from gender_age_train")
tables = cursor.fetchall() ## it returns list of tables present in the database
## showing all the tables one by one
for table in tables:
    print("Table gender_age_train has ", table, " rows")

cursor.execute("select count(*) from phone_brand_device_model")
tables = cursor.fetchall() ## it returns list of tables present in the database
## showing all the tables one by one
for table in tables:
    print("Table phone_brand_device_model has ", table, " rows")

Table events_data has  (3252950,)  rows
Table gender_age_train has  (74645,)  rows
Table phone_brand_device_model has  (87726,)  rows

# Extracting gender_age_train Table's data to a CSV file

In [0]:

engine = create_engine('mysql+pymysql://student:student@cpanel.insaid.co:3306/Capstone1')
df = pd.read_sql_table("gender_age_train", engine)
df.to_csv('gender_age_train.csv')

# Extracting phone_brand_device_model Table's data to a CSV fle

In [0]:

engine = create_engine('mysql+pymysql://student:student@cpanel.insaid.co:3306/Capstone1')
df = pd.read_sql_table("phone_brand_device_model", engine)
df.to_csv('phone_brand_device_model.csv')

# Copy data from the Google Drive

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
!ls drive/'My Drive'/1014capstone/
!mkdir -p data

events_data.csv  gender_age_train.csv  phone_brand_device_model.csv

In [0]:
!cp -R drive/'My Drive'/1014capstone/* data/

# Read events_data files to a Dataframe and work on it

## Read csv file to a data frame

In [0]:
# data = pd.read_csv('https://raw.githubusercontent.com/SudhakarAnemu/Term-4/master/Projects/Ghouls_train.csv', index_col=0)
dt_evnts = pd.read_csv('/content/data/events_data.csv')

## Frist 10 rows of the dt_evnts data

In [0]:
dt_evnts.head(10)

   event_id     device_id            timestamp  ...  latitude   city  state
0       1.0  2.918269e+16  2016-05-01 00:55:25  ...  28.68161  Delhi  Delhi
1    7104.0  2.918269e+16  2016-05-02 09:37:02  ...  28.68161  Delhi  Delhi
2   29661.0  2.918269e+16  2016-05-04 00:56:04  ...  28.68161  Delhi  Delhi
3   33133.0  2.918269e+16  2016-05-06 05:01:15  ...  28.68161  Delhi  Delhi
4   38980.0  2.918269e+16  2016-05-06 09:55:04  ...  28.68161  Delhi  Delhi
5   66398.0  2.918269e+16  2016-05-01 01:56:06  ...  28.68161  Delhi  Delhi
6   70894.0  2.918269e+16  2016-05-06 01:14:46  ...  28.68161  Delhi  Delhi
7   87185.0  2.918269e+16  2016-05-01 09:20:01  ...  28.68161  Delhi  Delhi
8   94644.0  2.918269e+16  2016-05-07 07:16:35  ...  28.68161  Delhi  Delhi
9  110018.0  2.918269e+16  2016-05-06 21:00:40  ...  28.68161  Delhi  Delhi

[10 rows x 7 columns]

In [0]:
print(150*'-')
print("1........Shape of the Dataset : ", dt_evnts.shape)
print(150*'-')
print("2........Columns : ", dt_evnts.columns)
print(150*'-')
print("3........Info of the Dataset : ", dt_evnts.info())
print(150*'-')
print("4........Description of the Dataset : ", dt_evnts.describe())
print(150*'-')
print("5........Verify the count of Null", dt_evnts.isnull().sum())

------------------------------------------------------------------------------------------------------------------------------------------------------
1........Shape of the Dataset :  (3252950, 7)
------------------------------------------------------------------------------------------------------------------------------------------------------
2........Columns :  Index(['event_id', 'device_id', 'timestamp', 'longitude', 'latitude', 'city',
       'state'],
      dtype='object')
------------------------------------------------------------------------------------------------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3252950 entries, 0 to 3252949
Data columns (total 7 columns):
event_id     float64
device_id    float64
timestamp    object
longitude    float64
latitude     float64
city         object
state        object
dtypes: float64(4), object(3)
memory usage: 173.7+ MB
3........Info of the Dataset :  None
------------------------------------------------------------------------------------------------------------------------------------------------------
4........Description of the Dataset :             event_id     device_id     longitude      latitude
count  3.252950e+06  3.252497e+06  3.252527e+06  3.252527e+06
mean   1.626476e+06  1.012200e+17  7.815868e+01  2.168851e+01
std    9.390459e+05  5.316758e+18  4.235570e+00  5.789111e+00
min    1.000000e+00 -9.222957e+18  1.256700e+01  8.190110e+00
25%    8.132382e+05 -4.540611e+18  7.583543e+01  1.780171e+01
50%    1.626476e+06  1.726820e+17  7.726814e+01  2.216454e+01
75%    2.439713e+06  4.861813e+18  8.031916e+01  2.868278e+01
max    3.252950e+06  9.222849e+18  9.545946e+01  4.187190e+01
------------------------------------------------------------------------------------------------------------------------------------------------------
5........Verify the count of Null event_id       0
device_id    453
timestamp      0
longitude    423
latitude     423
city           0
state        377
dtype: int64

In [0]:
dt_evnts.describe()

           event_id     device_id     longitude      latitude
count  3.252950e+06  3.252497e+06  3.252527e+06  3.252527e+06
mean   1.626476e+06  1.012200e+17  7.815868e+01  2.168851e+01
std    9.390459e+05  5.316758e+18  4.235570e+00  5.789111e+00
min    1.000000e+00 -9.222957e+18  1.256700e+01  8.190110e+00
25%    8.132382e+05 -4.540611e+18  7.583543e+01  1.780171e+01
50%    1.626476e+06  1.726820e+17  7.726814e+01  2.216454e+01
75%    2.439713e+06  4.861813e+18  8.031916e+01  2.868278e+01
max    3.252950e+06  9.222849e+18  9.545946e+01  4.187190e+01

In [0]:
dt_evnts.describe(include="all")

            event_id     device_id  ...     city    state
count   3.252950e+06  3.252497e+06  ...  3252950  3252573
unique           NaN           NaN  ...      933       32
top              NaN           NaN  ...    Delhi    Delhi
freq             NaN           NaN  ...   744276   751733
mean    1.626476e+06  1.012200e+17  ...      NaN      NaN
std     9.390459e+05  5.316758e+18  ...      NaN      NaN
min     1.000000e+00 -9.222957e+18  ...      NaN      NaN
25%     8.132382e+05 -4.540611e+18  ...      NaN      NaN
50%     1.626476e+06  1.726820e+17  ...      NaN      NaN
75%     2.439713e+06  4.861813e+18  ...      NaN      NaN
max     3.252950e+06  9.222849e+18  ...      NaN      NaN

[11 rows x 7 columns]

In [0]:
dt_evnts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3252950 entries, 0 to 3252949
Data columns (total 7 columns):
event_id     float64
device_id    float64
timestamp    object
longitude    float64
latitude     float64
city         object
state        object
dtypes: float64(4), object(3)
memory usage: 173.7+ MB

# Read gender_age_train files to a Dataframe and work on it

## Read csv file to a data frame

In [0]:
dt_gndAg = pd.read_csv('/content/data/gender_age_train.csv', index_col=0)

## Top 10 rows of the table

In [0]:
dt_gndAg.head(10)

             device_id gender  age   group
0 -8076087639492063270      M   35  M32-38
1 -2897161552818060146      M   35  M32-38
2 -8260683887967679142      M   35  M32-38
3 -4938849341048082022      M   30  M29-31
4   245133531816851882      M   30  M29-31
5 -1297074871525174196      F   24  F24-26
6   236877999787307864      M   36  M32-38
7 -8098239495777311881      M   38  M32-38
8   176515041953473526      M   33  M32-38
9  1596610250680140042      F   36  F33-42

In [0]:
print(150*'-')
print("Shape of the Dataset : ", dt_gndAg.shape)
print(150*'-')
print("Columns : ", dt_gndAg.columns)
print(150*'-')
print("Info of the Dataset : ", dt_gndAg.info())
print(150*'-')
print("Description of the Dataset : ", dt_gndAg.describe())
print(150*'-')
print("Verify the count of Null", dt_gndAg.isnull().sum())

------------------------------------------------------------------------------------------------------------------------------------------------------
Shape of the Dataset :  (74645, 4)
------------------------------------------------------------------------------------------------------------------------------------------------------
Columns :  Index(['device_id', 'gender', 'age', 'group'], dtype='object')
------------------------------------------------------------------------------------------------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 74645 entries, 0 to 74644
Data columns (total 4 columns):
device_id    74645 non-null int64
gender       74645 non-null object
age          74645 non-null int64
group        74645 non-null object
dtypes: int64(2), object(2)
memory usage: 2.8+ MB
Info of the Dataset :  None
------------------------------------------------------------------------------------------------------------------------------------------------------
Description of the Dataset :            device_id           age
count  7.464500e+04  74645.000000
mean  -7.491354e+14     31.410342
std    5.327150e+18      9.868735
min   -9.223067e+18      1.000000
25%   -4.617367e+18     25.000000
50%   -1.841362e+16     29.000000
75%    4.636656e+18     36.000000
max    9.222849e+18     96.000000
------------------------------------------------------------------------------------------------------------------------------------------------------
Verify the count of Null device_id    0
gender       0
age          0
group        0
dtype: int64